load-test.yml
config:
  target: 'http://localhost:5001' 
  phases:
    - duration: 30
      arrivalRate: 100 
  defaults:
    headers:
      User-Agent: 'Artillery'
scenarios:
  - flow:
      - post: # Signup user
          url: '/api/v1/auth/signup'
          json:
            first_name: 'testuser'
            last_name: 'lasttest'
            email: 'testuser@example.com'
            number: '05043222222'
            password: 'password123@'
      - post: # Login
          url: '/api/v1/auth/login'
          json:
            email: 'testuser@example.com'
            password: 'password123@'
      - get: # Donation
          url: '/api/v1/donations/1'
      - get: # Wallet
          url: '/api/v1/wallet/1'
      - post: # Transaction Pin
          url: '/api/v1/pins/1'
          json:
            
            pin: '5104'